Shadow56579/stm32/robot_board/Inc/nrf24l01p_impi.c
#include <nrf24l01p_impi.h>

// ******************* Function ******************* //
/*
	@brief Sets up nrf24l01+ with parameters specified in the structure of particular instance.
		Doesn't power up device. Doesn't enable any mode. Should be called at least one time for every nrf24l01+ instance.

	@param [in] nrf24_instance - pointer to the nrf24l01p instance for which function is called

	@return mistake code or 0 if no mistakes were found
*/
// ************************************************ //
uint32_t nrf24_basic_init(nrf24l01p *nrf24_instance)
{
	// Check if the particular device was initialized properly
	uint32_t declaration_mistake_code = nrf24_check_declarations(nrf24_instance);
	if ( declaration_mistake_code )
	{
		// Function is immediately stopped
		return declaration_mistake_code;
	}

	// Check if the particular device is at least in power-down mode. It takes 100ms for the device to load into the power-down from the power on.
	// So if the function is called immediately device could not be ready yet
	uint32_t checks = 0;
	while ( nrf24_check_if_alive(nrf24_instance) )
	{
		// Small dummy delay. Efficiency will depend on MCU clock speed
		for (uint32_t dummy_delay = 0; dummy_delay < 1000; dummy_delay++){}

		checks += 1;

		// If after 10 checks device is still not responding return mistake code
		if ( checks == 10 )
		{
			return NRF24_DEVICE_IS_NOT_CONNECTED;
		}
	}

	// To start SPI transmission high to low front should be detected. So we should prepare lone setting it high
	nrf24_instance->csn_high();

	// Go to standby-1 mode in case init is called to re-setup device
	nrf24_instance->ce_low();

	// This function will return mistake code if mistake occurs. If more then one mistake occurs only code of the last one will be returned
	uint32_t mistake_code = 0;

	// Default config setup - disable all interrupts, enable CRC with 1 byte encoding, TX mode with NO power up
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_W_REGISTER | NRF24_CONFIG);
	nrf24_instance->spi_write_byte(NRF24_INTERRUPTS_MASK | NRF24_EN_CRC | NRF24_CRCO);
	nrf24_instance->csn_high();

	// Checking frequency channel. Change to valid value if wrong and throw mistake. Then write value to NRF
	if ( nrf24_instance->frequency_channel < 1 )
	{
		nrf24_instance->frequency_channel = 1;
		mistake_code = NRF24_WRONG_CHANNEL_FREQUENCY;
	}
	else if ( nrf24_instance->frequency_channel > 124 )
	{
		nrf24_instance->frequency_channel = 124;
		mistake_code = NRF24_WRONG_CHANNEL_FREQUENCY;
	}
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_W_REGISTER | NRF24_RF_CH);
	nrf24_instance->spi_write_byte(nrf24_instance->frequency_channel);
	nrf24_instance->csn_high();

	// Set up device data rate and power output
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_W_REGISTER | NRF24_RF_SETUP);
	nrf24_instance->spi_write_byte(nrf24_instance->data_rate | nrf24_instance->power_output);
	nrf24_instance->csn_high();

	// Reset all interrupt flags in case setup is called more than one time to dynamically change parameters of nrf24l01+ instance
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_W_REGISTER | NRF24_STATUS);
	nrf24_instance->spi_write_byte(NRF24_INTERRUPTS_MASK);
	nrf24_instance->csn_high();

	// If data rate is 250kbps, set retransmission delay to 750us (datasheet recommended is 500us at 250kbps) and retransmission count to 2
	if (nrf24_instance->data_rate == nrf24_250_kbps)
	{
		nrf24_instance->csn_low();
		nrf24_instance->spi_write_byte(NRF24_W_REGISTER | NRF24_SETUP_RETR);
		nrf24_instance->spi_write_byte(0x2 | nrf24_wait_750_us);
		nrf24_instance->csn_high();
	}

	// Check if payload size is correct. If needed change value and throw mistake. Then write value for pipe 0
	if ( nrf24_instance->payload_size_in_bytes < 0 )
	{
		nrf24_instance->payload_size_in_bytes = 0;
		mistake_code = NRF24_WRONG_PAYLOAD_SIZE;
	}
	else if ( nrf24_instance->payload_size_in_bytes > 32 )
	{
		nrf24_instance->payload_size_in_bytes = 32;
		mistake_code = NRF24_WRONG_PAYLOAD_SIZE;
	}
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_W_REGISTER | NRF24_RX_PW_P0);
	nrf24_instance->spi_write_byte(nrf24_instance->payload_size_in_bytes);
	nrf24_instance->csn_high();

	// Write same payload size for pipe 1
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_W_REGISTER | NRF24_RX_PW_P1);
	nrf24_instance->spi_write_byte(nrf24_instance->payload_size_in_bytes);
	nrf24_instance->csn_high();

	// Device was initialized
	nrf24_instance->device_was_initialized = 1;

	return mistake_code;
}


// ******************* Function ******************* //
/*
	@brief Checks if particular devices responses, if not returns mistake code.

	@note Reads RF_CH register (which is never equals 0). If response data equals 0 - device is not connected, returns mistake code.

	@param [in] nrf24_instance - pointer to the nrf24l01p instance for which function is called.

	@return mistake code or 0 if no mistakes were found.
*/
// ************************************************ //
uint32_t nrf24_check_if_alive(nrf24l01p *nrf24_instance)
{
	nrf24_instance->csn_low();

	nrf24_instance->spi_write_byte(NRF24_RF_CH);

	if ( nrf24_instance->spi_write_byte(NRF24_NOP) )
	{
		nrf24_instance->csn_high();
		return 0;
	}

	nrf24_instance->csn_high();
	return NRF24_DEVICE_IS_NOT_CONNECTED;
}

// ******************* Function ******************* //
/*
	@brief Checks if all function pointers of particular nrf24l01+ instance struct were initialized. If not returns mistake code.
		Those mistakes should be handled as critical, so any function calling this one should immediately return mistake code.

	@param [in] nrf24_instance - pointer to the nrf24l01p instance for which function is called

	@return first found mistake code or 0 if no mistakes were found
 */
// ************************************************ //
uint32_t nrf24_check_declarations(nrf24l01p *nrf24_instance)
{
	if ( nrf24_instance->ce_high == 0 )
	{
		return NRF24_CE_HIGH_FUNCTION_IS_MISSING;
	}

	if ( nrf24_instance->ce_low == 0 )
	{
		return NRF24_CE_LOW_FUNCTION_IS_MISSING;
	}

	if ( nrf24_instance->csn_high == 0 )
	{
		return NRF24_CSN_HIGH_FUNCTION_IS_MISSING;
	}

	if ( nrf24_instance->csn_low == 0 )
	{
		return NRF24_CSN_LOW_FUNCTION_IS_MISSING;
	}

	if ( nrf24_instance->spi_write_byte == 0 )
	{
		return NRF24_SPI_WRITE_FUNCTION_IS_MISSING;
	}

