Shadow56579/stm32/robot_board/Inc/nrf24l01p_impi.c
	return 0;
}

// ******************* Function ******************* //
/*
	@brief Changes device setup to TX, powers device up. Device is ready to transmit data.

	@note Doesn't pull CE logic high for power efficiency - device stays in standby-1. CE is used only in data transmission.

	@param [in] nrf24_instance - pointer to the nrf24l01p instance for which function is called

	@return first found mistake code or 0 if no mistakes were found
 */
// ************************************************ //
uint32_t nrf24_tx_mode(nrf24l01p *nrf24_instance)
{
	// Check if device was initialized
	if ( nrf24_instance->device_was_initialized == 0 )
	{
		return NRF24_INSTANCE_WAS_NOT_INITIALIZED;
	}

	// Go to standby-1 mode if CE = 1 to safely switch modes
	nrf24_instance->ce_low();

	// Read current config state
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_R_REGISTER | NRF24_CONFIG);
	uint8_t current_register_state = nrf24_instance->spi_write_byte(NRF24_NOP);
	nrf24_instance->csn_high();


	// Add power up to current config
	current_register_state &= ~NRF24_PRIM_RX;

	// Write new config state with POWER_UP
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_W_REGISTER | NRF24_CONFIG);
	nrf24_instance->spi_write_byte(current_register_state | NRF24_PWR_UP);
	nrf24_instance->csn_high();

	// Clear TX FIFO if it was not empty
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_FLUSH_TX);
	nrf24_instance->csn_high();

	// Reset all interrupt flags
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_W_REGISTER | NRF24_STATUS);
	nrf24_instance->spi_write_byte(NRF24_INTERRUPTS_MASK);
	nrf24_instance->csn_high();

	return 0;
}

// ******************* Function ******************* //
/*
	@brief Changes device settings to RX, powers up the device, start device. Device is ready to receive data.

	@param [in] nrf24_instance - pointer to the nrf24l01p instance for which function is called

	@return first found mistake code or 0 if no mistakes were found
 */
// ************************************************ //
uint32_t nrf24_rx_mode(nrf24l01p *nrf24_instance)
{
	// Check if device was initialized
	if ( nrf24_instance->device_was_initialized == 0 )
	{
		return NRF24_INSTANCE_WAS_NOT_INITIALIZED;
	}

	// Go to standby-1 mode
	nrf24_instance->ce_low();

	// Read current config state
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_R_REGISTER | NRF24_CONFIG);
	uint8_t current_register_state = nrf24_instance->spi_write_byte(NRF24_NOP);
	nrf24_instance->csn_high();

	// Add power up to current config
	current_register_state |= NRF24_PRIM_RX;

	// Write new config state with power up
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_W_REGISTER | NRF24_CONFIG);
	nrf24_instance->spi_write_byte(current_register_state | NRF24_PWR_UP);
	nrf24_instance->csn_high();

	// Clear RX FIFO if it was not empty
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_FLUSH_RX);
	nrf24_instance->csn_high();

	// Reset all interrupt flags
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_W_REGISTER | NRF24_STATUS);
	nrf24_instance->spi_write_byte(NRF24_INTERRUPTS_MASK);
	nrf24_instance->csn_high();

	// NRF should always be in RX mode not to miss data
	nrf24_instance->ce_high();

	return 0;
}

// ******************* Function ******************* //
/*
	@brief Sets new TX and RX pipe 0 addresses. Address should be 5 bytes long. Powers device down, So after this function either nrf24_rx_mode or nrf24_tx_mode should be called.

	@param [in] nrf24_instance - pointer to the nrf24l01p instance for which function is called
	@param [in] new_tx_address[5] - array which contains new tx address. Programmer must make sure, that array is exactly 5 elements long.

	@return first found mistake code or 0 if no mistakes were found

	@note Addresses should be written in reverse order, so that they can be represented as they were stored in the array.
 */
// ************************************************ //
uint32_t nrf24_set_tx_address(nrf24l01p *nrf24_instance, const uint8_t new_tx_address[5])
{
	// Check if device was initialized
	if ( nrf24_instance->device_was_initialized == 0 )
	{
		return NRF24_INSTANCE_WAS_NOT_INITIALIZED;
	}

	// if device was in RX or TX mode it should be reset to standby-1
	nrf24_instance->ce_low();

	// Change address of pipe 0 which is used for reception  of ACK
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_W_REGISTER | NRF24_RX_ADDR_P0);
	for(uint32_t i = 0; i < 5; ++i)
	{
		nrf24_instance->spi_write_byte(new_tx_address[4-i]);
	}
	nrf24_instance->csn_high();

	// Change TX address
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_W_REGISTER | NRF24_TX_ADDR);
	for(uint32_t i = 0; i < 5; ++i)
	{
		nrf24_instance->spi_write_byte(new_tx_address[4-i]);
	}
	nrf24_instance->csn_high();

	return 0;
}

// ******************* Function ******************* //
/*
	@brief Sets new RX address for pipe 1. Address should be 5 bytes long. 4 first bytes are used as base for addresses of pipes 2 to 5.
		Powers device down, So after this function either nrf24_rx_mode or nrf24_tx_mode should be called.

	@param [in] nrf24_instance - pointer to the nrf24l01p instance for which function is called
	@param [in] pipe_address[] - new base address of pipes 1-5 (first 4 bytes) and unique byte for pipe 1 (last byte). user should make sure, that array has a length of 5 bytes.

	@return first found mistake code or 0 if no mistakes were found
 */
// ************************************************ //

uint32_t nrf24_enable_pipe1(nrf24l01p *nrf24_instance, uint8_t pipe_address[])
{
	if ( nrf24_instance->device_was_initialized == 0 )
	{
		return NRF24_INSTANCE_WAS_NOT_INITIALIZED;
	}

	// Stop RX mode if was on
	nrf24_instance->ce_low();

