Shadow56579/stm32/robot_board/Inc/nrf24l01p_impi.c
	// Write new pipe 1 address
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_W_REGISTER | NRF24_RX_ADDR_P1);
	for(uint32_t i = 0; i < 5; ++i)
	{
		nrf24_instance->spi_write_byte(pipe_address[4-i]);
	}
	nrf24_instance->csn_high();

	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_R_REGISTER | NRF24_EN_RXADDR);
	uint8_t register_state = nrf24_instance->spi_write_byte(NRF24_NOP);
	nrf24_instance->csn_high();

	register_state |= 0x02;

	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_W_REGISTER | NRF24_EN_RXADDR);
	nrf24_instance->spi_write_byte(register_state);
	nrf24_instance->csn_high();

	return 0;
}

// ******************* Function ******************* //
/*
	@brief Sets new RX address for pipe from 2 to 5 and enables corresponding pipe. Use base from pipe 4, so only one byte changes.
		Powers device down, So after this function either nrf24_rx_mode or nrf24_tx_mode should be called.

	@param [in] nrf24_instance - pointer to the nrf24l01p instance for which function is called.
	@param [in] pipe_number - number of the pipe to be enabled.
	@param [in] pipe_address_last_byte - last address byte for the particular pipe.

	@return first found mistake code or 0 if no mistakes were found
 */
// ************************************************ //
uint32_t nrf24_enable_pipe2_5(nrf24l01p *nrf24_instance, uint32_t pipe_number, uint8_t pipe_address_last_byte)
{
	if ( nrf24_instance->device_was_initialized == 0 )
	{
		return NRF24_INSTANCE_WAS_NOT_INITIALIZED;
	}

	// Stop RX mode if was on
	nrf24_instance->ce_low();

	// Wrong pipe number is critical mistake
	if ( pipe_number < 2 || pipe_number > 5 )
	{
		return NRF24_WRONG_PIPE_NUMBER;
	}

	// Set new address
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_W_REGISTER | (NRF24_RX_ADDR_P0 + pipe_number));
	nrf24_instance->spi_write_byte(pipe_address_last_byte);
	nrf24_instance->csn_high();

	// Set payload size
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_W_REGISTER | (NRF24_RX_PW_P0 + pipe_number));
	nrf24_instance->spi_write_byte(nrf24_instance->payload_size_in_bytes);
	nrf24_instance->csn_high();

	// Enable pipe by reading current state and adding new bit into it
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_R_REGISTER | NRF24_EN_RXADDR);
	uint8_t current_register_state = nrf24_instance->spi_write_byte(NRF24_NOP);
	nrf24_instance->csn_high();

	current_register_state |= 1<<pipe_number;

	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_W_REGISTER | NRF24_EN_RXADDR);
	nrf24_instance->spi_write_byte(current_register_state);
	nrf24_instance->csn_high();

	return 0;
}

// ******************* Function ******************* //
/*
	@brief Sends message with either acknowledgment or not.

	@param [in] nrf24_instance - pointer to the nrf24l01p instance for which function is called.
	@param [in] payload - pointer to the payload (array, containing message to be sent).
	@param [in] payload_size_in_bytes - payload size in bytes.
	@param [in] should send ack - flag that determines if the message should be sent with or without acknowledgment.

	@return first found mistake code or 0 if no mistakes were found
 */
// ************************************************ //
uint32_t nrf24_send_message(nrf24l01p *nrf24_instance,  void *payload, uint32_t payload_size_in_bytes, int32_t should_flush_tx, int32_t should_send_ack)
{
	if ( nrf24_instance->device_was_initialized == 0 )
	{
		return NRF24_INSTANCE_WAS_NOT_INITIALIZED;
	}

	if (should_flush_tx) //Flush Tx FIFO if needed
	{
		// Clear TX FIFO
		nrf24_instance->csn_low();
		nrf24_instance->spi_write_byte(NRF24_FLUSH_TX);
		nrf24_instance->csn_high();
	}

	uint32_t mistake_code = 0;

	if ( payload_size_in_bytes > nrf24_instance->payload_size_in_bytes )
	{
		payload_size_in_bytes = nrf24_instance->payload_size_in_bytes;
		mistake_code = NRF24_WRONG_MESSAGE_SIZE;
	}

	// Reset all interrupt flags
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_W_REGISTER | NRF24_STATUS);
	nrf24_instance->spi_write_byte(NRF24_INTERRUPTS_MASK);
	nrf24_instance->csn_high();

	// Data will be sent byte by byte
	uint8_t *current_byte_to_send = payload;

	// If payload input is shorter then actual payload, not specified bytes will be sent as 0.
	uint32_t amount_of_zeros_requered = nrf24_instance->payload_size_in_bytes - payload_size_in_bytes;

	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(should_send_ack == 1 ? NRF24_W_TX_PAYLOAD : W_TX_PAYLOAD_NO_ACK);

	// Send data
	for ( uint32_t i = 0; i < payload_size_in_bytes; ++i )
	{
		nrf24_instance->spi_write_byte(*current_byte_to_send);
		current_byte_to_send++;
	}

	// Fill empty space with 0 if needed.
	for ( uint32_t i = 0; i < amount_of_zeros_requered; ++i )
	{
		nrf24_instance->spi_write_byte(0);
	}
	nrf24_instance->csn_high();

	// Send device into the Tx mode to send one payload
	nrf24_instance->ce_high();
	for ( int i = 0; i < 500; ++i ){}
	nrf24_instance->ce_low();

	return mistake_code;
}

// ******************* Function ******************* //
/*
	@brief Checks if new data is available. If so return the number of the pipe which received message.

	@param [in] nrf24_instance - pointer to the nrf24l01p instance for which function is called

	@return number of the pipe which received message or 0 if no message was received.
 */
// ************************************************ //
uint8_t nrf24_is_new_data_availiable(nrf24l01p *nrf24_instance)
{
	// IF device is not initialized will return no data
	if ( nrf24_instance->device_was_initialized == 0 )
	{
		return 0;
	}

	nrf24_instance->csn_low();
	uint8_t current_device_status = nrf24_instance->spi_write_byte(NRF24_R_REGISTER | NRF24_FIFO_STATUS);
	uint8_t current_fifo_status = nrf24_instance->spi_write_byte(NRF24_NOP);
	nrf24_instance->csn_high();

	if((current_fifo_status & 0x01) == 0)
	{

		return (current_device_status &0x0E) >> 1;
	}

