Shadow56579/stm32/robot_board/Inc/nrf24l01p_impi.c
	return 0;
}

// ******************* Function ******************* //
/*
	@brief Saves last received message into the input array.

	@param [in] nrf24_instance - pointer to the nrf24l01p instance for which function is called
	@param [in] payload_storage - pointer to the array into which the message should be saved.
	@param [in] payload_size_in_bytes - payload size in bytes.

	@return number of the pipe which received message or 0 if no message was received.
 */
// ************************************************ //
uint32_t nrf24_read_message(nrf24l01p *nrf24_instance, void *payload_storage, uint32_t payload_size_in_bytes)
{
	if ( nrf24_instance->device_was_initialized == 0 )
	{
		return NRF24_INSTANCE_WAS_NOT_INITIALIZED;
	}

	uint8_t mistake_code = 0;

	uint8_t *current_byte_to_be_read = payload_storage;

	// Check for proper payload size
	if(payload_size_in_bytes > nrf24_instance->payload_size_in_bytes)
	{
		payload_size_in_bytes = nrf24_instance->payload_size_in_bytes;
		mistake_code = NRF24_WRONG_PAYLOAD_SIZE;
	}
	if(payload_size_in_bytes < 0)
	{
		return NRF24_WRONG_PAYLOAD_SIZE;
	}

	// Read data stored in RX FIFO
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_R_RX_PAYLOAD);
	for (uint32_t i = 0; i < payload_size_in_bytes; ++i)
	{
		*current_byte_to_be_read = nrf24_instance->spi_write_byte(NRF24_NOP);
		current_byte_to_be_read++;
	}

	uint32_t zeros_to_be_read = nrf24_instance->payload_size_in_bytes - payload_size_in_bytes;
	for(uint32_t i = 0; i < zeros_to_be_read; ++i)
	{
		nrf24_instance->spi_write_byte(NRF24_NOP);
	}
	nrf24_instance->csn_high();

	// Clear new RX data interrupt flag
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_W_REGISTER | NRF24_STATUS);
	nrf24_instance->spi_write_byte(NRF24_MASK_RX_DR);
	nrf24_instance->csn_high();

	return mistake_code;
}

// ******************* Function ******************* //
/*
	@brief Enables interrupts with 1 in related input parameters, disables interrupts with 0. So to disable all interrupts call function with all 0 as inputs.

	@param [in] nrf24_instance - pointer to the nrf24l01p instance for which function is called
	@param [in] enable_rx_dr - flag to enable RX interrupt
	@param [in] enable_tx_dr - flag to enable TX interrupt
	@param [in] enable_max_rt - flag to enable "maximum number of retransmissions exceeded" interrupt

	@return mistake code or 0 if no mistakes were found
 */
// ************************************************ //
uint32_t nrf24_enable_interrupts(nrf24l01p *nrf24_instance,	uint32_t enable_rx_dr, uint32_t enable_tx_ds, uint32_t enable_max_rt)
{
	if ( nrf24_instance->device_was_initialized == 0 )
	{
		return NRF24_INSTANCE_WAS_NOT_INITIALIZED;
	}

	uint8_t interrupts_to_be_enabled = 0;

	if ( enable_rx_dr == 0 )
	{
		interrupts_to_be_enabled |= 0x40;
	}
	if ( enable_tx_ds == 0 )
	{
		interrupts_to_be_enabled |= 0x20;
	}
	if ( enable_max_rt == 0 )
	{
		interrupts_to_be_enabled |= 0x10;
	}

	// Read current config state
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_R_REGISTER | NRF24_CONFIG);
	uint8_t current_register_state = nrf24_instance->spi_write_byte(NRF24_NOP);
	nrf24_instance->csn_high();

	// Remove interrupt masking from current config state
	current_register_state &= ~NRF24_INTERRUPTS_MASK;
	current_register_state |= interrupts_to_be_enabled;

	// Write new config state
	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_W_REGISTER | NRF24_CONFIG);
	nrf24_instance->spi_write_byte(current_register_state);
	nrf24_instance->csn_high();

	return 0;
}

// ******************* Function ******************* //
/*
	@brief Returns interrupt flags in raw state. Clears interrupts flags.

	@note Interrupts flags in registers are in bits number 4, 5 and 6 (MAX_RT, TX_DS, RX_DR respectively). So return value can be 0x00 or 0x10 to 0x70.

	@param [in] nrf24_instance - pointer to the nrf24l01p instance for which function is called.

	@return NRF24_STATUS register interrupts bits.
 */
// ************************************************ //
uint8_t nrf24_get_interrupts_status(nrf24l01p * nrf24_instance)
{

	nrf24_instance->csn_low();
	uint8_t interrupt_status = nrf24_instance->spi_write_byte(NRF24_W_REGISTER | NRF24_STATUS) & 0xF0;
	nrf24_instance->spi_write_byte(NRF24_INTERRUPTS_MASK);
	nrf24_instance->csn_high();

	return interrupt_status;
}

// ******************* Function ******************* // (V)
/*
	@brief Sets new values for retransmit delay and count of retransmissions for particular nrf24l01+ device.
		If retransmit count = 0 no retransmissions are produced.

	@param [in] nrf24_instance - pointer to the nrf24l01p instance for which function is called
	@param [in] new_retransmit_delay - new value of retransmission delay, should be expressed as nrf24_auto_retransmit_delay enum member
	@param [in] new_retransmit_count - new retransmit count

	@return first found mistake code or 0 if no mistakes were found
 */
// ************************************************ //
uint32_t nrf24_update_retransmission_params(nrf24l01p * nrf24_instance, nrf24_auto_retransmit_delay new_retransmit_delay, uint32_t new_retransmit_count)
{
	// Check if device was initialized
	if ( nrf24_instance->device_was_initialized == 0 )
	{
		return NRF24_INSTANCE_WAS_NOT_INITIALIZED;
	}

	uint32_t mistake_code = 0;

	if(new_retransmit_count < 0)
	{
		new_retransmit_count = 0;
		mistake_code = NRF24_WRONG_RETRANSMIT_COUNT;
	}
	else if ( new_retransmit_count > 15 )
	{
		new_retransmit_count = 15;
		mistake_code = NRF24_WRONG_RETRANSMIT_COUNT;
	}

	nrf24_instance->csn_low();
	nrf24_instance->spi_write_byte(NRF24_W_REGISTER | NRF24_SETUP_RETR);
	nrf24_instance->spi_write_byte(new_retransmit_delay | new_retransmit_count);
	nrf24_instance->csn_high();

	return mistake_code;
}

// EOF

